results/nightly_deepep_b300/mxfp8-nightly-tp8-none-mxfp8-g32-low-latency-specon-isl1024-osl1024-c1-n32.log
### tag=mxfp8-nightly-tp8-none-mxfp8-g32-low-latency-specon-isl1024-osl1024-c1-n32
### endpoint=localhost:30000 image=hy4-nightly-deepep:latest
### quant=mxfp8 tp=8 nnodes=1 profile=low-latency spec=on
### topo=nightly-tp8-none-mxfp8-g32 gpus=8 backend=none
### moe_a2a=none ep=8 dp_attn=unknown v2_cap=unknown chunk=unknown
### isl=1024 osl=1024 num_prompts=32 concurrency=1 max_running=128
### started=2026-09-08T04:13:23Z
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/awq/awq.py:53: UserWarning: Only CUDA, HIP and XPU support AWQ currently.
  warnings.warn(f"Only CUDA, HIP and XPU support AWQ currently.")
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/gguf.py:69: UserWarning: Only CUDA, MUSA and NPU support GGUF quantization currently.
  warnings.warn(f"Only CUDA, MUSA and NPU support GGUF quantization currently.")
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview-FP8', served_model_name=None, tokenizer='/models/Hy4-preview-FP8', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/results/mxfp8-nightly-tp8-none-mxfp8-g32-low-latency-specon-isl1024-osl1024-c1-n32.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview-FP8', served_model_name=None, tokenizer='/models/Hy4-preview-FP8', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/results/mxfp8-nightly-tp8-none-mxfp8-g32-low-latency-specon-isl1024-osl1024-c1-n32.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 32768
#Output tokens: 32768
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 32/32 [03:25<00:00,  6.42s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     32        
Benchmark duration (s):                  205.47    
Total input tokens:                      32768     
Total input text tokens:                 32768     
Total generated tokens:                  32768     
Total generated tokens (retokenized):    32656     
Request throughput (req/s):              0.16      
Input token throughput (tok/s):          159.48    
Output token throughput (tok/s):         159.48    
Peak output token throughput (tok/s):    46.00     
Peak concurrent requests:                2         
Total token throughput (tok/s):          318.96    
Concurrency:                             1.00      
Accept length:                           3.66      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6419.67   
Median E2E Latency (ms):                 6006.94   
P90 E2E Latency (ms):                    7789.42   
P95 E2E Latency (ms):                    8055.21   
P99 E2E Latency (ms):                    8646.77   
---------------Time to First Token----------------
Mean TTFT (ms):                          133.16    
Median TTFT (ms):                        131.58    
P90 TTFT (ms):                           131.98    
P95 TTFT (ms):                           137.24    
P99 TTFT (ms):                           179.36    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.15      
Median TPOT (ms):                        5.73      
P90 TPOT (ms):                           7.49      
P95 TPOT (ms):                           7.75      
P99 TPOT (ms):                           8.32      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           6.15      
Median ITL (ms):                         5.63      
P90 ITL (ms):                            6.00      
P95 ITL (ms):                            10.58     
P99 ITL (ms):                            22.32     
Max ITL (ms):                            23.59     
==================================================
### finished=2026-09-08T04:17:20Z rc=0